let data=[
  {
    "name": "雜技藝人的血液",
    "m1": "狼血x2",
    "m2": "精靈的葉子 x1",
    "m3": "黑暗的粉 x1",
    "m4": "清液體試藥 x1",
    "m5": "",
    "amount": 1
  },
  {
    "name": "暴君的血液",
    "m1": "巨魔血x2",
    "m2": "修道士的樹枝 x1",
    "m3": "野蠻的痕跡 x1",
    "m4": "純粹的粉試藥 x1",
    "m5": "",
    "amount": 1
  },
  {
    "name": "金屬溶解劑",
    "m1": "粗糙的石塊 x4",
    "m2": "野蠻的痕跡 x2",
    "m3": "熔化的鐵塊 x3",
    "m4": "清液體試藥 x1",
    "m5": "",
    "amount": 1
  },
  {
    "name": "合板強化劑",
    "m1": "血紅樹木節 x3",
    "m2": "冷杉樹樹液 x4",
    "m3": "大地的痕跡 x3",
    "m4": "純粹的粉試藥 x1",
    "m5": "",
    "amount": 1
  },
  {
    "name": "皮油料",
    "m1": "丹楓樹樹液 x3",
    "m2": "飛翔的痕跡 x3",
    "m3": "黑暗的粉 x2",
    "m4": "清液體試藥 x1",
    "m5": "",
    "amount": 1
  },
  {
    "name": "寶石研磨劑",
    "m1": "祈願的痕跡 x2",
    "m2": "純水x6",
    "m3": "加工煤炭 x4",
    "m4": "純粹的粉試藥 x1",
    "m5": "",
    "amount": 1
  },
  {
    "name": "清液體試藥",
    "m1": "雜草x1",
    "m2": "黎明草 x1",
    "m3": "純水x1",
    "m4": "食鹽 x1",
    "m5": "",
    "amount": "3"
  },
  {
    "name": "純粹的粉試藥",
    "m1": "雜草x1",
    "m2": "銀灰杜鵑花 x1",
    "m3": "純水x1",
    "m4": "砂糖 x1",
    "m5": "",
    "amount": "3"
  },
  {
    "name": "止血的靈藥",
    "m1": "雲蘑菇 x1",
    "m2": "白蠟樹樹液 x1",
    "m3": "純水x3",
    "m4": "純粹的粉試藥 x1",
    "m5": "",
    "amount": 1
  },
  {
    "name": "海狗的靈藥",
    "m1": "狼血x4",
    "m2": "侏儒蘑菇 x3",
    "m3": "白樺樹樹液 x1",
    "m4": "純水 x5",
    "m5": "",
    "amount": 1
  }
];